In [5]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
json={
    "name": "John Doe",
    "age": 30,
    "city": "New York",
    "email": "john.doe@example.com",
    "interests": ["reading", "hiking", "music"],
    "education": {
        "degree": "Bachelor of Science",
        "major": "Computer Science",
        "year": 2015
    }
}

In [3]:
json

{'name': 'John Doe',
 'age': 30,
 'city': 'New York',
 'email': 'john.doe@example.com',
 'interests': ['reading', 'hiking', 'music'],
 'education': {'degree': 'Bachelor of Science',
  'major': 'Computer Science',
  'year': 2015}}

In [9]:
json2 ={
    "Name": ["Alice", "Bob", "Charlie", "David", "Emily"],
    "Age": [25, 30, 35, 40, 27],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Boston"],
    "Email": ["alice@example.com", "bob@example.com", "charlie@example.com", "david@example.com", "emily@example.com"],
    "Salary": [50000, 60000, 70000, 80000, 55000]}

In [10]:
json2

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
 'Age': [25, 30, 35, 40, 27],
 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Boston'],
 'Email': ['alice@example.com',
  'bob@example.com',
  'charlie@example.com',
  'david@example.com',
  'emily@example.com'],
 'Salary': [50000, 60000, 70000, 80000, 55000]}

In [11]:
df = DataFrame(json2)

In [12]:
df

      Name  Age         City                Email  Salary
0    Alice   25     New York    alice@example.com   50000
1      Bob   30  Los Angeles      bob@example.com   60000
2  Charlie   35      Chicago  charlie@example.com   70000
3    David   40      Houston    david@example.com   80000
4    Emily   27       Boston    emily@example.com   55000

In [13]:
import json

In [16]:
json_string = '''
{
    "name": "John Doe",
    "age": 30,
    "city": "New York",
    "email": "john.doe@example.com",
    "interests": ["reading", "hiking", "music"],
    "education": {
        "degree": "Bachelor of Science",
        "major": "Computer Science",
        "year": 2015
    }
}
'''

In [17]:
data = json.loads(json_string)

In [18]:
data

{'name': 'John Doe',
 'age': 30,
 'city': 'New York',
 'email': 'john.doe@example.com',
 'interests': ['reading', 'hiking', 'music'],
 'education': {'degree': 'Bachelor of Science',
  'major': 'Computer Science',
  'year': 2015}}

In [20]:
json.dumps(data
          )

'{"name": "John Doe", "age": 30, "city": "New York", "email": "john.doe@example.com", "interests": ["reading", "hiking", "music"], "education": {"degree": "Bachelor of Science", "major": "Computer Science", "year": 2015}}'

In [27]:
dframe = DataFrame(data['interests'])

In [36]:
dframe

         0
0  reading
1   hiking
2    music

In [28]:
data = json.loads(json_string)

# Option 1: Single row DataFrame
dframe1 = pd.DataFrame([data])
print("Option 1:")
print(dframe1)

# Option 2: Key-value pairs as rows
dframe2 = pd.DataFrame(list(data.items()), columns=['Key', 'Value'])
print("\nOption 2:")
print(dframe2)

Option 1:
       name  age      city                 email                 interests  \
0  John Doe   30  New York  john.doe@example.com  [reading, hiking, music]

                                           education
0  {'degree': 'Bachelor of Science', 'major': 'Co...

Option 2:
         Key                                              Value
0       name                                           John Doe
1        age                                                 30
2       city                                           New York
3      email                               john.doe@example.com
4  interests                           [reading, hiking, music]
5  education  {'degree': 'Bachelor of Science', 'major': 'Co...